#Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество 
#вхождений одна в другую. 

line1 = input('input first message: ')
line2 = input('input second message: ')

print(line1.count(line2))


