#дана строка текста. Напишите программу для подсчета стоимости строки, исходя из того, что любой символ
# в том числе пробел, стоит 60 копеек. Ответ дайте в рублях и копейках. 

line = str(input('input a massage '))
print(len(line))