# Напишите программу, которая принимает на вход число N и выдыет последовательность из N членов. 

n = int(input('input number of '))
num=-3
for i in range (n):
    print(num**i)